Revit 2026 API

# StructuralSectionGeneralWFlangeFillet Property

---

Flange Fillet - fillet radius at the flange end.

**Namespace:** Autodesk.Revit.DB.Structure.StructuralSections**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public double FlangeFillet { get; set; }
```
```vb
Public Property FlangeFillet As Double
	Get
	Set
```
```cpp
public:
property double FlangeFillet {
	double get ();
	void set (double value);
}
```
```fsharp
member FlangeFillet : float with get, set
```

#### Property Value

Double

#### Reference

StructuralSectionGeneralW Class

Autodesk.Revit.DB.Structure.StructuralSections Namespace